In [1]:
import pandas as pd

In [2]:
A=pd.Series([2,3,4,5],index=['a','b','c','d'])

In [3]:
A.values

array([2, 3, 4, 5])

In [4]:
A['a'] #Like Dictionaries

np.int64(2)

In [5]:
A['a':'c']

a    2
b    3
c    4
dtype: int64

Pandas(Series)

In [6]:
grades_dict = { 'A':4, 'B':3.5, 'C':3, 'D':2.5}
grades = pd.Series(grades_dict)

In [7]:
grades.values

array([4. , 3.5, 3. , 2.5])

In [8]:
grades

A    4.0
B    3.5
C    3.0
D    2.5
dtype: float64

In [9]:
grades[0:2] #jika menggunakan angka maka posisi 2 tidak ikut

A    4.0
B    3.5
dtype: float64

In [10]:
grades['A':'C']

A    4.0
B    3.5
C    3.0
dtype: float64

Pandas (Data Frame)

In [11]:
marks_dict = {'A':85, 'B':75, 'C':65, 'D':55}
marks = pd.Series(marks_dict)

In [12]:
grades

A    4.0
B    3.5
C    3.0
D    2.5
dtype: float64

In [13]:
marks

A    85
B    75
C    65
D    55
dtype: int64

In [14]:
D = pd.DataFrame({'Marks':marks, 'Grades':grades})

In [15]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [16]:
D.T

           A     B     C     D
Marks   85.0  75.0  65.0  55.0
Grades   4.0   3.5   3.0   2.5

In [17]:
D.values[2,0] #rows 3 and column 1

np.float64(65.0)

In [18]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [19]:
D['ScaledMarks'] = (100*(D['Marks']/90)).round(2) #addnewcolumn

In [20]:
D

   Marks  Grades  ScaledMarks
A     85     4.0        94.44
B     75     3.5        83.33
C     65     3.0        72.22
D     55     2.5        61.11

In [21]:
del D['ScaledMarks']

In [22]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [23]:
G = D[D['Marks'] > 70]

In [24]:
G

   Marks  Grades
A     85     4.0
B     75     3.5

Pandas(NaN)

In [25]:
A=pd.DataFrame([{'a':1,'b':2}, {'b':2, 'c':3}])

In [26]:
A

     a  b    c
0  1.0  2  NaN
1  NaN  2  3.0

In [27]:
A.fillna(0)

     a  b    c
0  1.0  2  0.0
1  0.0  2  3.0

In [28]:
A.dropna

<bound method DataFrame.dropna of      a  b    c
0  1.0  2  NaN
1  NaN  2  3.0>

Pandas (Indexing)

In [29]:
A = pd.Series(['a','b','c'], index=[1,3,5])

In [30]:
A[1] #explisit

'a'

In [31]:
A[1:3] #implisit

3    b
5    c
dtype: object

In [32]:
A.loc[1:3]

1    a
3    b
dtype: object

In [33]:
A.iloc[1:3]

3    b
5    c
dtype: object

In [34]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [35]:
D.iloc[2,:]

Marks     65.0
Grades     3.0
Name: C, dtype: float64

In [36]:
D.iloc[::-1,:]

   Marks  Grades
D     55     2.5
C     65     3.0
B     75     3.5
A     85     4.0